{
	"version": "https://jsonfeed.org/version/1",
	"title": "Ville Saalo",
	"icon": "https://micro.blog/ZeroOne/avatar.jpg",
	"home_page_url": "https://ville.saalo.moi/",
	"feed_url": "https://ville.saalo.moi/feed.json",
	"items": [
		
			{
				"id": "http://zeroone.micro.blog/2025/03/30/are-you-really-using-ai.html",
				"title": "Are you really using AI?",
				"content_html": "<p>Yesterday I was scrolling through my feed when I came across a <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7311760309575151616\">short video by Allie K. Miller</a>, who&rsquo;s something of a thought leader in the AI business space. She mentioned that you probably use AI already, but asked if you&rsquo;re <em>really using</em> it? AI can enable so many novel use cases that merely enhancing your old processes is kind of wasting its full potential.</p>\n<p>It made me stop and think. Like many, I&rsquo;ve been using AI tools here and there - asking ChatGPT to help with writing, generating some ideas, maybe summarizing content. But am I actually reimagining how I work?</p>\n<p>Allie mentioned how after 10 years of creating AI content (7 of those without AI tools), she completely rebuilt her workflow. Now she dictates to Otter AI while walking, runs her content through multiple AI systems, and formats everything in Beehiiv with auto-links. More steps, but apparently 80% time saved. That&rsquo;s not just enhancement.</p>\n<p>I wonder if most of us are in that &ldquo;scratching the surface&rdquo; phase with AI that Allie mentions. We&rsquo;re asking AI to help with tasks we already do, rather than rethinking what tasks we should be doing in the first place.</p>\n<p>I&rsquo;m obviously not using AI to its fullest potential either. My current workflows still look pretty much like they did a couple of years ago, with some AI assistance sprinkled in rather than built around them. There&rsquo;s something to think about there.</p>\n<p>(By the way, I don&rsquo;t often subscribe to newsletters, but I do follow Allie&rsquo;s work. If any of this piqued your interest, you might want to check out her newsletter at <a href=\"https://aiwithallie.beehiiv.com/subscribe?ref=z6NeejKck1\">AI with Allie</a>.)</p>\n",
				"content_text": "Yesterday I was scrolling through my feed when I came across a [short video by Allie K. Miller](https://www.linkedin.com/feed/update/urn:li:activity:7311760309575151616), who's something of a thought leader in the AI business space. She mentioned that you probably use AI already, but asked if you're _really using_ it? AI can enable so many novel use cases that merely enhancing your old processes is kind of wasting its full potential.\n\nIt made me stop and think. Like many, I've been using AI tools here and there - asking ChatGPT to help with writing, generating some ideas, maybe summarizing content. But am I actually reimagining how I work?\n\nAllie mentioned how after 10 years of creating AI content (7 of those without AI tools), she completely rebuilt her workflow. Now she dictates to Otter AI while walking, runs her content through multiple AI systems, and formats everything in Beehiiv with auto-links. More steps, but apparently 80% time saved. That's not just enhancement.\n\nI wonder if most of us are in that \"scratching the surface\" phase with AI that Allie mentions. We're asking AI to help with tasks we already do, rather than rethinking what tasks we should be doing in the first place.\n\nI'm obviously not using AI to its fullest potential either. My current workflows still look pretty much like they did a couple of years ago, with some AI assistance sprinkled in rather than built around them. There's something to think about there.\n\n(By the way, I don't often subscribe to newsletters, but I do follow Allie's work. If any of this piqued your interest, you might want to check out her newsletter at [AI with Allie](https://aiwithallie.beehiiv.com/subscribe?ref=z6NeejKck1).)\n",
				"date_published": "2025-03-30T19:36:09+03:00",
				"url": "https://ville.saalo.moi/2025/03/30/are-you-really-using-ai.html",
				"tags": ["AI"]
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/29/vibe-coding-an-ant-colony.html",
				"title": "Vibe coding an ant colony simulator",
				"content_html": "<p>When it comes to household chores, ironing is one of my favorites as it often allows me to shorten my &ldquo;Watch later&rdquo; playlist (771 videos there as of writing this&hellip;) in YouTube. Last time I did ironing I watched this cool video of an ant colony simulator:</p>\n<!-- raw HTML omitted -->\n<p>The fun thing is that it creates fascinating emergent behavior from a few simple rules. The ants walk around randomly, leaving behind a trail of pheromones like breadcrumbs pointing back home, and when they encounter food, they pick some up and follow the pheromone trail back to the nest. While carrying food they leave behind another type of pheromone that point the ants to the food source.</p>\n<p>This seemed like an interesting exercise in <a href=\"https://en.wikipedia.org/wiki/Vibe_coding\">vibe coding</a> where you just describe your need in your own words and let an AI do the actual programming for you. Vibe coding seems to split the opinions sharply: some find that it makes coding more equal and available to anyone, others loathe the idea of an influx of AI-generated trash.</p>\n<p>My take is that AI is a tool. Just as you don&rsquo;t become a better photographer by buying a more expensive camera, you don&rsquo;t become a (better) programmer by using smarter tools. If you are prone to creating bugs without AI, then AI just enhances your ability to create those bugs faster.</p>\n<p>But sometimes it does not matter. If you&rsquo;re working on a hobby project for yourself and you&rsquo;re only running it locally, then it might as well have all the security holes in the world. However, the situation quickly changes if you deploy your application online and it has a backend to store any kind of a state.</p>\n<p>Also an important reason for this exercise to me, besides wanting to watch virtual ants, was simply to keep up with and assess the current state of AI code generation. We seem to be heading towards ever more advanced and omnipresent AI tools, so it&rsquo;s for the best if you start getting familiar with them already.</p>\n<p>So, how did it go? I&rsquo;ve had successes with vibe coding so I was very optimistic. I wish I could tell you it was a great success: that I gave ChatGPT one prompt and it gave me a working piece of code right away, and then I spent an hour watching my new virtual ant colony do its things. Alas, it was not a great success.</p>\n<p>I started with ChatGPT 4o and described what I wanted to it: a simple ant colony simulator that runs in a browser, and where the ants leave pheromone trails and follow them. Emergent behavior from simple rules, like in the YouTube video I had watched. The system quickly blurted me out an HTML file with Javascript, and it was very promising. The simulation even launched successfully and ants began crawling around! You could even place down the nest, the food, and some walls, though the UI was clunky &ndash; you couldn&rsquo;t even see the item you placed the simulation was running.</p>\n<p>I started to iterate the app with ChatGPT, giving it feedback on what works and what does not and got it improved a bit. Then, however, it seemed as if the system started to lose the context: features that had worked stopped working randomly on new iterations. I restarted the process a few times with new prompts and with the o3-mini-high model, but the results were similar. The AI either went for an overly complex model that didn&rsquo;t work, or left it too simple and added shortcut rules that broke the idea of emergent behavior from simple rules. For example, the AI thought that it would be great if an ant carrying food could head directly to the nest, no need to follow any pheromone trail. Needless to say, that isn&rsquo;t what I want.</p>\n<p>Next I tried with a local Qwen2.5-Coder, running on Ollama and <a href=\"https://www.openwebui.com/\">Open WebUI</a>. This seemed promising at first when Open WebUI even opened a browser frame next to the prompt as the model was coming up with the code. However, that approach didn&rsquo;t work at all when the model split the HTML and the Javascript to different files, and the UI wasn&rsquo;t made for such a complex setup. I might have retried with a refined prompt to ask it to output all the code into the same file, but I think it fell for one of the mistakes I had already seen ChatGPT make. Also I couldn&rsquo;t find a way to restart the preview frame if I lost it due to, say, refreshing the window, which was a let-down.</p>\n<p>Finally I tried the new Google AI Studio with the Gemini 2.5 Pro Experimental 03-25 model. Previously I had tried to just give the models the task to create the app in one go, but now I had a different approach. I told the model I wanted it to make me an ant colony simulator, but not yet: we should plan it first.</p>\n<p>So, next I asked Gemini to explain me like I&rsquo;m five how ants in real life find food and then back to the nest. I adapted this approach from Zach Bart, founder of <a href=\"https://en.m.wikipedia.org/wiki/Zachtronics\">Zachtronics</a>, my favorite puzzle game studio. He mentioned in some interview that when he wants to make a new thematic game about, say, chemistry, he checks the teaching material about that subject available for some 10-15 year old kids, because that hits the sweet spot for what most people would find plausible enough but not overly complicated.</p>\n<p>Gemini provided me with the description, I asked a few clarifying questions, and off we went again. This time I made the additional request to use the <a href=\"https://p5js.org/\">p5.js</a> library, which is apparently very popular with these kind of apps requiring simple graphics. Unfortunately, Gemini&rsquo;s result was the only one that didn&rsquo;t do anything at all once run! I quickly debugged it having an invalid reference to the HTML element that was supposed to host the arena, though, and again the ants started crawling. But, long story short, Gemini made roughly the same mistakes that ChatGPT had made, like giving the ants a magical compass pointing to the nest, despite explicitly being told to have them follow the pheromone trails.</p>\n<p>In the end this was all about the journey, not the end result, so I don&rsquo;t mind not having my own ant colony simulator. Key takeaways:</p>\n<ul>\n<li>It&rsquo;s cumbersome when you need to copy-paste generated code around. The generation should be integrated directly into your actual development environment. You can even do all this with your phone only, but that is <em>very</em> cumbersome.</li>\n<li>If you try to avoid coding, you&rsquo;ll just end up debugging someone else&rsquo;s (the AI&rsquo;s) code. I, for one, usually prefer writing new code to debugging old one. And when the code is not made by yourself, you don&rsquo;t have a mental model of it, so debugging takes a lot of time.</li>\n<li>The technology is advancing fast. I have no doubt that some other model could&rsquo;ve successfully created a proper ant colony simulator already, or that the models I tried now will be able to do it in a year.</li>\n</ul>\n<p>&hellip;and indeed I hope to revisit this topic in the future.</p>\n",
				"content_text": "When it comes to household chores, ironing is one of my favorites as it often allows me to shorten my \"Watch later\" playlist (771 videos there as of writing this...) in YouTube. Last time I did ironing I watched this cool video of an ant colony simulator:\n\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/hTHpEF_jcu4\" title=\"Ant Simulator, a fresh new version\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\nThe fun thing is that it creates fascinating emergent behavior from a few simple rules. The ants walk around randomly, leaving behind a trail of pheromones like breadcrumbs pointing back home, and when they encounter food, they pick some up and follow the pheromone trail back to the nest. While carrying food they leave behind another type of pheromone that point the ants to the food source.\n\nThis seemed like an interesting exercise in [vibe coding](https://en.wikipedia.org/wiki/Vibe_coding) where you just describe your need in your own words and let an AI do the actual programming for you. Vibe coding seems to split the opinions sharply: some find that it makes coding more equal and available to anyone, others loathe the idea of an influx of AI-generated trash.\n\nMy take is that AI is a tool. Just as you don't become a better photographer by buying a more expensive camera, you don't become a (better) programmer by using smarter tools. If you are prone to creating bugs without AI, then AI just enhances your ability to create those bugs faster.\n\nBut sometimes it does not matter. If you're working on a hobby project for yourself and you're only running it locally, then it might as well have all the security holes in the world. However, the situation quickly changes if you deploy your application online and it has a backend to store any kind of a state.\n\nAlso an important reason for this exercise to me, besides wanting to watch virtual ants, was simply to keep up with and assess the current state of AI code generation. We seem to be heading towards ever more advanced and omnipresent AI tools, so it's for the best if you start getting familiar with them already.\n\nSo, how did it go? I've had successes with vibe coding so I was very optimistic. I wish I could tell you it was a great success: that I gave ChatGPT one prompt and it gave me a working piece of code right away, and then I spent an hour watching my new virtual ant colony do its things. Alas, it was not a great success.\n\nI started with ChatGPT 4o and described what I wanted to it: a simple ant colony simulator that runs in a browser, and where the ants leave pheromone trails and follow them. Emergent behavior from simple rules, like in the YouTube video I had watched. The system quickly blurted me out an HTML file with Javascript, and it was very promising. The simulation even launched successfully and ants began crawling around! You could even place down the nest, the food, and some walls, though the UI was clunky -- you couldn't even see the item you placed the simulation was running.\n\nI started to iterate the app with ChatGPT, giving it feedback on what works and what does not and got it improved a bit. Then, however, it seemed as if the system started to lose the context: features that had worked stopped working randomly on new iterations. I restarted the process a few times with new prompts and with the o3-mini-high model, but the results were similar. The AI either went for an overly complex model that didn't work, or left it too simple and added shortcut rules that broke the idea of emergent behavior from simple rules. For example, the AI thought that it would be great if an ant carrying food could head directly to the nest, no need to follow any pheromone trail. Needless to say, that isn't what I want.\n\nNext I tried with a local Qwen2.5-Coder, running on Ollama and [Open WebUI](https://www.openwebui.com/). This seemed promising at first when Open WebUI even opened a browser frame next to the prompt as the model was coming up with the code. However, that approach didn't work at all when the model split the HTML and the Javascript to different files, and the UI wasn't made for such a complex setup. I might have retried with a refined prompt to ask it to output all the code into the same file, but I think it fell for one of the mistakes I had already seen ChatGPT make. Also I couldn't find a way to restart the preview frame if I lost it due to, say, refreshing the window, which was a let-down.\n\nFinally I tried the new Google AI Studio with the Gemini 2.5 Pro Experimental 03-25 model. Previously I had tried to just give the models the task to create the app in one go, but now I had a different approach. I told the model I wanted it to make me an ant colony simulator, but not yet: we should plan it first.\n\nSo, next I asked Gemini to explain me like I'm five how ants in real life find food and then back to the nest. I adapted this approach from Zach Bart, founder of [Zachtronics](https://en.m.wikipedia.org/wiki/Zachtronics), my favorite puzzle game studio. He mentioned in some interview that when he wants to make a new thematic game about, say, chemistry, he checks the teaching material about that subject available for some 10-15 year old kids, because that hits the sweet spot for what most people would find plausible enough but not overly complicated.\n\nGemini provided me with the description, I asked a few clarifying questions, and off we went again. This time I made the additional request to use the [p5.js](https://p5js.org/) library, which is apparently very popular with these kind of apps requiring simple graphics. Unfortunately, Gemini's result was the only one that didn't do anything at all once run! I quickly debugged it having an invalid reference to the HTML element that was supposed to host the arena, though, and again the ants started crawling. But, long story short, Gemini made roughly the same mistakes that ChatGPT had made, like giving the ants a magical compass pointing to the nest, despite explicitly being told to have them follow the pheromone trails.\n\nIn the end this was all about the journey, not the end result, so I don't mind not having my own ant colony simulator. Key takeaways:\n\n* It's cumbersome when you need to copy-paste generated code around. The generation should be integrated directly into your actual development environment. You can even do all this with your phone only, but that is _very_ cumbersome. \n* If you try to avoid coding, you'll just end up debugging someone else's (the AI's) code. I, for one, usually prefer writing new code to debugging old one. And when the code is not made by yourself, you don't have a mental model of it, so debugging takes a lot of time. \n* The technology is advancing fast. I have no doubt that some other model could've successfully created a proper ant colony simulator already, or that the models I tried now will be able to do it in a year. \n\n...and indeed I hope to revisit this topic in the future. \n",
				"date_published": "2025-03-29T18:41:06+03:00",
				"url": "https://ville.saalo.moi/2025/03/29/vibe-coding-an-ant-colony.html",
				"tags": ["AI"]
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/26/finished-reading-the-colour-of.html",
				"title": "Terry Pratchett: The Colour of Magic",
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781407034379\">The Colour Of Magic</a> by Terry Pratchett 📚</p>\n<p>According to a legend, somewhere on the far side of the Disc, beyond the great sea, lies the Counterweight Continent. Since it&rsquo;s assumed to balance the Disc’s other landmasses, yet appears relatively small, it’s believed to consist largely of heavy gold. Few sane people, of course, believe this story — until one day, a ship sailing up the smelly Morpork river brings a Tourist to the shores of Ankh-Morpork.</p>\n<p>The locals don’t understand what a &ldquo;tourist&rdquo; is, but quickly deduce it means roughly the same as &ldquo;idiot&rdquo;. The man dresses oddly, acts strangely, and carries an absurd amount of gold — whose value he doesn’t seem to grasp. He’s also accompanied by a sentient pearwood chest, the Luggage, which is generally docile but turns into an unstoppable, murderous beast if its master is threatened.</p>\n<p>Rincewind, a wizard who failed utterly at wizardry and is mostly a coward — though otherwise fairly clever — finds that he can speak the tourist’s language. The tourist, Twoflower, hires Rincewind as his guide. Soon, Ankh-Morpork is entirely ablaze, and Rincewind and Twoflower are fleeing by land, sea, and air.</p>\n<p>The Colour of Magic launched the now-famous Discworld series in 1983, and over thirty novels have followed. Quite the achievement, especially considering this book alone is so packed with ideas and events that it feels like Pratchett wanted to include every concept he had.</p>\n<p>I originally borrowed the book for my second grader, but after he found it too confusing after the first couple dozen pages, I ended up reading it myself. I’ve probably read it long ago, but Pratchett’s absurd British humor still hits the mark for me — and presumably for other fans of Monty Python and Douglas Adams as well.</p>\n",
				"content_text": "Finished reading: [The Colour Of Magic](https://micro.blog/books/9781407034379) by Terry Pratchett 📚\n\nAccording to a legend, somewhere on the far side of the Disc, beyond the great sea, lies the Counterweight Continent. Since it's assumed to balance the Disc’s other landmasses, yet appears relatively small, it’s believed to consist largely of heavy gold. Few sane people, of course, believe this story — until one day, a ship sailing up the smelly Morpork river brings a Tourist to the shores of Ankh-Morpork.\n\nThe locals don’t understand what a \"tourist\" is, but quickly deduce it means roughly the same as \"idiot\". The man dresses oddly, acts strangely, and carries an absurd amount of gold — whose value he doesn’t seem to grasp. He’s also accompanied by a sentient pearwood chest, the Luggage, which is generally docile but turns into an unstoppable, murderous beast if its master is threatened.\n\nRincewind, a wizard who failed utterly at wizardry and is mostly a coward — though otherwise fairly clever — finds that he can speak the tourist’s language. The tourist, Twoflower, hires Rincewind as his guide. Soon, Ankh-Morpork is entirely ablaze, and Rincewind and Twoflower are fleeing by land, sea, and air.\n\nThe Colour of Magic launched the now-famous Discworld series in 1983, and over thirty novels have followed. Quite the achievement, especially considering this book alone is so packed with ideas and events that it feels like Pratchett wanted to include every concept he had.\n\nI originally borrowed the book for my second grader, but after he found it too confusing after the first couple dozen pages, I ended up reading it myself. I’ve probably read it long ago, but Pratchett’s absurd British humor still hits the mark for me — and presumably for other fans of Monty Python and Douglas Adams as well.\n",
				"date_published": "2025-03-26T20:19:51+03:00",
				"url": "https://ville.saalo.moi/2025/03/26/finished-reading-the-colour-of.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/23/lists-of-random-things.html",
				"title": "List(s) of Random Things",
				"content_html": "<p>About a week ago I was exploring other random blogs when I came across the <a href=\"https://heydingus.net/blog/2025/3/7-things-this-week-172\">7 Things This Week [#172]</a> post by Jarrod Blundy. What caught my eye was the number on the title: Jarrod has been persistently listing seven things each week for more than three years already! In this day and age of single-click fire-and-forget retweets I find it admirable that someone can resist that urge to share the links immediately and do instead a little bit of curating, even adding a sentence or two of their own justifying why a particular link is interesting.</p>\n<p>It surprised me too that literally just a random collection of links had this effect on me, so I dug deeper using Gemini&rsquo;s new Deep Research feature. (And this time I mean that <a href=\"https://gemini.google.com/app\">Google AI</a>, not the <a href=\"https://zeroone.micro.blog/2025/03/16/gemini-protocol.html\">Gemini protocol</a>.) I must say Gemini is impressive: it formed a research plan according to my ramblings, then went away and crunched the internet for maybe ten minutes or so, and eventually returned with a convincing full report of the history of &ldquo;lists of things&rdquo; in print and online media.</p>\n<p>I&rsquo;m not going to bore you with all the details, but I learned, for example, that the <em>Time</em> magazine started a Potpourri column of random things already in 1923. For the online world, an early example of something similar is Dave Winer&rsquo;s DaveNet newsletter that started in 1994. I looked it up and found the <a href=\"http://scripting.com/davenet/about.html\">DaveNet archive</a> &ndash; and oh boy isn&rsquo;t it a treasure trove if you&rsquo;re interested in the early world wide web! Dave covered, for example, the browser wars that <a href=\"https://zeroone.micro.blog/2025/03/20/vivaldi-browser.html\">I also recently referred to</a>, and the rise of the new and exciting programming language called Java. Dave wrote his newsletter for ten years and posted between one and a dozed emails each month, so check it out!</p>\n<p>As for myself, I won&rsquo;t dare to commit to posting a regular list of things, but I&rsquo;ll keep the concept in mind and start now with a very short list. Specifically, it&rsquo;s a shout out to a couple of my favorite YouTubers and their most recent work.</p>\n<hr>\n<h2 id=\"random-things-sunday\">Random Things Sunday</h2>\n<ul>\n<li>Mark Rober, known for glitter bombs and squirrel obstacle courses, <a href=\"https://youtu.be/IQJL3htsDyQ\">snuck a LIDAR system into a Disneyland rollercoaster to map it out, and then tested Tesla&rsquo;s camera based driving aids against another car equipped with a LIDAR</a>.</li>\n<li>Shawn from the Stuff Made Here channel had a rare failed project, <a href=\"https://youtu.be/BO_YGcSzJdA\">trying to make a helicopter powered by a flywheel</a>.</li>\n</ul>\n",
				"content_text": "About a week ago I was exploring other random blogs when I came across the [7 Things This Week [#172]](https://heydingus.net/blog/2025/3/7-things-this-week-172) post by Jarrod Blundy. What caught my eye was the number on the title: Jarrod has been persistently listing seven things each week for more than three years already! In this day and age of single-click fire-and-forget retweets I find it admirable that someone can resist that urge to share the links immediately and do instead a little bit of curating, even adding a sentence or two of their own justifying why a particular link is interesting.\n\nIt surprised me too that literally just a random collection of links had this effect on me, so I dug deeper using Gemini's new Deep Research feature. (And this time I mean that [Google AI](https://gemini.google.com/app), not the [Gemini protocol](https://zeroone.micro.blog/2025/03/16/gemini-protocol.html).) I must say Gemini is impressive: it formed a research plan according to my ramblings, then went away and crunched the internet for maybe ten minutes or so, and eventually returned with a convincing full report of the history of \"lists of things\" in print and online media.\n\nI'm not going to bore you with all the details, but I learned, for example, that the _Time_ magazine started a Potpourri column of random things already in 1923. For the online world, an early example of something similar is Dave Winer's DaveNet newsletter that started in 1994. I looked it up and found the [DaveNet archive](http://scripting.com/davenet/about.html) -- and oh boy isn't it a treasure trove if you're interested in the early world wide web! Dave covered, for example, the browser wars that [I also recently referred to](https://zeroone.micro.blog/2025/03/20/vivaldi-browser.html), and the rise of the new and exciting programming language called Java. Dave wrote his newsletter for ten years and posted between one and a dozed emails each month, so check it out!\n\nAs for myself, I won't dare to commit to posting a regular list of things, but I'll keep the concept in mind and start now with a very short list. Specifically, it's a shout out to a couple of my favorite YouTubers and their most recent work. \n\n----\n\n## Random Things Sunday\n\n* Mark Rober, known for glitter bombs and squirrel obstacle courses, [snuck a LIDAR system into a Disneyland rollercoaster to map it out, and then tested Tesla's camera based driving aids against another car equipped with a LIDAR](https://youtu.be/IQJL3htsDyQ).\n* Shawn from the Stuff Made Here channel had a rare failed project, [trying to make a helicopter powered by a flywheel](https://youtu.be/BO_YGcSzJdA). \n",
				"date_published": "2025-03-23T18:38:31+03:00",
				"url": "https://ville.saalo.moi/2025/03/23/lists-of-random-things.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/22/star-wars-episode-iv-a.html",
				"title": "Star Wars Episode IV: A New Hope in 100 words",
				"content_html": "<p>I figured it would be an interesting little challenge to condense the plot of the original <em>Star Wars</em> into a very short format, but with as many spoilers as possible. I settled for a limit of one hundred words. Here goes; maybe you can use it as a refresher if you haven&rsquo;t seen the movie in a while, but quit reading now if you haven&rsquo;t seen it and want to watch and fully enjoy it later: 🍿</p>\n<hr>\n<p>Vader intercepts Leia&rsquo;s ship seeking stolen Death Star plans. R2-D2 and C-3PO escape to Tatooine, are captured by Jawas and sold to Luke. R2-D2 shows message from Leia and goes looking for Obi-Wan Kenobi. Stormtroopers kill Luke&rsquo;s family. Luke joins Kenobi, meets Han and Chewie in Mos Eisley. They flee in Millennium Falcon but find Alderaan destroyed. Death Star captures Falcon. Kenobi shuts down the tractor beam while the others rescue Leia, visiting a trash compactor. Kenobi faces Vader, is struck down, becomes one with the Force. Falcon escapes, rebels mount an attack, Luke uses the Force, Death Star explodes.</p>\n",
				"content_text": "I figured it would be an interesting little challenge to condense the plot of the original _Star Wars_ into a very short format, but with as many spoilers as possible. I settled for a limit of one hundred words. Here goes; maybe you can use it as a refresher if you haven't seen the movie in a while, but quit reading now if you haven't seen it and want to watch and fully enjoy it later: 🍿\n\n----\n\nVader intercepts Leia's ship seeking stolen Death Star plans. R2-D2 and C-3PO escape to Tatooine, are captured by Jawas and sold to Luke. R2-D2 shows message from Leia and goes looking for Obi-Wan Kenobi. Stormtroopers kill Luke's family. Luke joins Kenobi, meets Han and Chewie in Mos Eisley. They flee in Millennium Falcon but find Alderaan destroyed. Death Star captures Falcon. Kenobi shuts down the tractor beam while the others rescue Leia, visiting a trash compactor. Kenobi faces Vader, is struck down, becomes one with the Force. Falcon escapes, rebels mount an attack, Luke uses the Force, Death Star explodes.\n",
				"date_published": "2025-03-22T21:34:45+03:00",
				"url": "https://ville.saalo.moi/2025/03/22/star-wars-episode-iv-a.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/20/vivaldi-browser.html",
				"title": "Vivaldi browser",
				"content_html": "<p>Around the turn of the millennium the <a href=\"https://en.wikipedia.org/wiki/Browser_wars\">browser wars</a> were a thing. The first browser war saw Netscape Navigator unsuccessfully defend against the new Microsoft Internet Explorer. After a few years the remains of Netscape Navigator were forged into a new browser called Phoenix, soon renamed to Firebird, and finally to Firefox. I, however, stayed strongly in camp Opera during this time.</p>\n<p>Opera was developed by a Norwegian company by the same name, and it was by far the most innovative browser of the time. They were the first ones to introduce tabs, a speed dial window, customizable shortcuts, quick search bar, and, my favorite, mouse gestures: to go back in the history, press and hold the right mouse button, swipe left, and release. Extremely simple and efficient, and there were gestures for all the other commands you could wish for, too. Opera also recognized the importance of a community and successfully ran the My Opera site for years.</p>\n<p>My Opera was, unfortunately, shut down in 2014. Then, two years later in 2016, Opera was sold to China, and I stopped using it. In the same year, however, the former CEO of Opera Software released the first stable version of a new browser called <a href=\"https://en.wikipedia.org/wiki/Vivaldi_(web_browser)\">Vivaldi</a>.</p>\n<p>Vivaldi is to me the spiritual successor of Opera. You get the familiar full customizability and a bunch of features out of the box that other browsers can only have as plugins, if even that. Notoriously, Google recently basically removed the extremely popular uBlock Origin ad blocker from their plugin store, obviously because showing ads to you is their primary business. 😬 Other than ad blocking and tracker blocking, Vivaldi has, for example, a feed reader, tiling &amp; stacking of tabs, the aforementioned mouse gestures, themes, and much more.</p>\n<p>I recently wrote about the <a href=\"https://zeroone.micro.blog/2025/03/18/kagi-search.html\">Kagi Search</a>, to which someone who read it could&rsquo;ve wondered if I use the Chrome browser anyway, in which case my privacy wouldn&rsquo;t be any more protected with Kagi than it is with Google. I do need Chrome for work, but at home I use Vivaldi and haven&rsquo;t signed in to my Google account with it. I&rsquo;m under no illusion that Google wouldn&rsquo;t still be able to track me, but at least I don&rsquo;t need to make it trivial to them.</p>\n<p>If you&rsquo;ve been looking for a browser that puts you in control, Vivaldi is worth a try. Get it from <a href=\"https://vivaldi.com/\">vivaldi.com</a> to give it a spin!</p>\n",
				"content_text": "Around the turn of the millennium the [browser wars](https://en.wikipedia.org/wiki/Browser_wars) were a thing. The first browser war saw Netscape Navigator unsuccessfully defend against the new Microsoft Internet Explorer. After a few years the remains of Netscape Navigator were forged into a new browser called Phoenix, soon renamed to Firebird, and finally to Firefox. I, however, stayed strongly in camp Opera during this time.\n\nOpera was developed by a Norwegian company by the same name, and it was by far the most innovative browser of the time. They were the first ones to introduce tabs, a speed dial window, customizable shortcuts, quick search bar, and, my favorite, mouse gestures: to go back in the history, press and hold the right mouse button, swipe left, and release. Extremely simple and efficient, and there were gestures for all the other commands you could wish for, too. Opera also recognized the importance of a community and successfully ran the My Opera site for years.\n\nMy Opera was, unfortunately, shut down in 2014. Then, two years later in 2016, Opera was sold to China, and I stopped using it. In the same year, however, the former CEO of Opera Software released the first stable version of a new browser called [Vivaldi](https://en.wikipedia.org/wiki/Vivaldi_(web_browser)).\n\nVivaldi is to me the spiritual successor of Opera. You get the familiar full customizability and a bunch of features out of the box that other browsers can only have as plugins, if even that. Notoriously, Google recently basically removed the extremely popular uBlock Origin ad blocker from their plugin store, obviously because showing ads to you is their primary business. 😬 Other than ad blocking and tracker blocking, Vivaldi has, for example, a feed reader, tiling & stacking of tabs, the aforementioned mouse gestures, themes, and much more.\n\nI recently wrote about the [Kagi Search](https://zeroone.micro.blog/2025/03/18/kagi-search.html), to which someone who read it could've wondered if I use the Chrome browser anyway, in which case my privacy wouldn't be any more protected with Kagi than it is with Google. I do need Chrome for work, but at home I use Vivaldi and haven't signed in to my Google account with it. I'm under no illusion that Google wouldn't still be able to track me, but at least I don't need to make it trivial to them.\n\nIf you've been looking for a browser that puts you in control, Vivaldi is worth a try. Get it from [vivaldi.com](https://vivaldi.com/) to give it a spin!\n",
				"date_published": "2025-03-20T17:33:04+03:00",
				"url": "https://ville.saalo.moi/2025/03/20/vivaldi-browser.html",
				"tags": ["indie-web"]
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/18/kagi-search.html",
				"title": "Kagi Search",
				"content_html": "<p>About three months ago I ditched Google as my primary search engine and started using <a href=\"https://kagi.com/\">Kagi</a> instead &ndash; and haven&rsquo;t looked back.</p>\n<p>Kagi is a subscription based service: you get to test it for free for one hundred searches, and if you are satisfied, you can start with the 5 USD/month (+tax) plan that includes 300 searches. I&rsquo;ve found that with my usage I can usually manage about 27 days, after which I can just renew the monthly subscription a bit early with a couple of clicks.</p>\n<p>Why pay for your search engine, then, when Google is free? Well, the old saying goes that if you&rsquo;re not paying for the product, then you are the product. In practice this means that you will be shown lots of ads and &ldquo;sponsored links&rdquo; &ndash; which are just ads by another name. It seems that companies often buy ads that target their competitors too, so if you&rsquo;re looking for info about product X of company Y, then the first &ldquo;search results&rdquo; you get are actually about the competing product Z by company W. All this gets quite tiring in the long run. I also noticed that not only because of this but because of ChatGPT my Google searches had dropped dramatically. Google just didn&rsquo;t have any pull anymore.</p>\n<p>What&rsquo;s Kagi doing better, then? For one, they don&rsquo;t have ads, so they are not incentivized to serve any advertisers but you, the user. For a user there are some neat features, such as increasing or decreasing the priority of any sites in your search results, something that I have indeed missed in Google. Kagi also has a delightful <a href=\"https://blog.kagi.com/small-web\">Small Web initiative</a> highlighting little personal sites that you couldn&rsquo;t find with Google even by accident. Kagi also has an actual <a href=\"https://kagi.com/changelog\">changelog</a> &ndash; when have you ever seen a search engine, or any major web site for that, display one proudly? These little details make Kagi feel like it&rsquo;s made by humans for humans. <a href=\"https://dkb.io/post/DEPR_kagi-interview\">Kagi&rsquo;s origin story</a> is also worth reading.</p>\n<p>I&rsquo;d say there&rsquo;s a growing sense that people are tired of being the product and of the general enshittification of the web. People want control over their own their data, they don&rsquo;t want Meta, Google, or that dumpster fire X deciding what they may access and see. You constantly get to read about people and businesses that are locked out of their Instagram accounts for no apparent reason and there&rsquo;s nothing they can do to appeal because it&rsquo;s all handled by some faceless algorithms. That&rsquo;s a contributing factor also to why I&rsquo;m using the Micro.blog platform for hosting this blog and why I&rsquo;m using Kagi: I want to support the smaller players that are still trying to Do The Right Thing.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "About three months ago I ditched Google as my primary search engine and started using [Kagi](https://kagi.com/) instead -- and haven't looked back.\n\nKagi is a subscription based service: you get to test it for free for one hundred searches, and if you are satisfied, you can start with the 5 USD/month (+tax) plan that includes 300 searches. I've found that with my usage I can usually manage about 27 days, after which I can just renew the monthly subscription a bit early with a couple of clicks.\n\nWhy pay for your search engine, then, when Google is free? Well, the old saying goes that if you're not paying for the product, then you are the product. In practice this means that you will be shown lots of ads and \"sponsored links\" -- which are just ads by another name. It seems that companies often buy ads that target their competitors too, so if you're looking for info about product X of company Y, then the first \"search results\" you get are actually about the competing product Z by company W. All this gets quite tiring in the long run. I also noticed that not only because of this but because of ChatGPT my Google searches had dropped dramatically. Google just didn't have any pull anymore.\n\nWhat's Kagi doing better, then? For one, they don't have ads, so they are not incentivized to serve any advertisers but you, the user. For a user there are some neat features, such as increasing or decreasing the priority of any sites in your search results, something that I have indeed missed in Google. Kagi also has a delightful [Small Web initiative](https://blog.kagi.com/small-web) highlighting little personal sites that you couldn't find with Google even by accident. Kagi also has an actual [changelog](https://kagi.com/changelog) -- when have you ever seen a search engine, or any major web site for that, display one proudly? These little details make Kagi feel like it's made by humans for humans. [Kagi's origin story](https://dkb.io/post/DEPR_kagi-interview) is also worth reading. \n\nI'd say there's a growing sense that people are tired of being the product and of the general enshittification of the web. People want control over their own their data, they don't want Meta, Google, or that dumpster fire X deciding what they may access and see. You constantly get to read about people and businesses that are locked out of their Instagram accounts for no apparent reason and there's nothing they can do to appeal because it's all handled by some faceless algorithms. That's a contributing factor also to why I'm using the Micro.blog platform for hosting this blog and why I'm using Kagi: I want to support the smaller players that are still trying to Do The Right Thing.\n\n\n<img src=\"uploads/2025/e906bb6a86.png\" width=\"600\" height=\"271\" alt=\"\">\n",
				"date_published": "2025-03-18T01:39:29+03:00",
				"url": "https://ville.saalo.moi/2025/03/18/kagi-search.html",
				"tags": ["indie-web"]
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/16/caffeine.html",
				"title": "Caffeine",
				"content_html": "<p>There is a common misconception that energy drinks have a particularly high caffeine concentration. Often the people who fuss over this are coffee drinkers themselves.</p>\n<p>Energy drinks typically have 32 mg of caffeine per 100 ml. This translates to the following total amounts of caffeine per container:</p>\n<table>\n<thead>\n<tr>\n<th>Container Size</th>\n<th>Caffeine (mg)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>0.25 L</td>\n<td>80 mg</td>\n</tr>\n<tr>\n<td>0.33 L</td>\n<td>106 mg</td>\n</tr>\n<tr>\n<td>0.5 L</td>\n<td>160 mg</td>\n</tr>\n</tbody>\n</table>\n<p>Now, coffee on the other hand has about 44,8 - 80 mg of caffeine per 100 ml, translating to the following dozages:</p>\n<table>\n<thead>\n<tr>\n<th>Container Size</th>\n<th>Caffeine (mg) (Range)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>0.125 L (small cup)</td>\n<td>56 - 100 mg</td>\n</tr>\n<tr>\n<td>0.2 L (medium mug)</td>\n<td>90 - 160 mg</td>\n</tr>\n<tr>\n<td>0.25 L (large mug)</td>\n<td>112 - 250 mg</td>\n</tr>\n</tbody>\n</table>\n<p>(<a href=\"https://www.terveyskirjasto.fi/dlk01123\">Source</a>)</p>\n<p>And finally, here&rsquo;s the same as an image &ndash; I hope that by now you&rsquo;ll agree that if you want to be worried about someone getting too much caffeine, you should be worried of those who drink coffee. Coffee doesn&rsquo;t even come with any warnings of the max recommended servings per day, unlike energy drinks. And this post doesn&rsquo;t even begin to address espresso, which is about four times as strong as regular coffee!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "There is a common misconception that energy drinks have a particularly high caffeine concentration. Often the people who fuss over this are coffee drinkers themselves.\n\nEnergy drinks typically have 32 mg of caffeine per 100 ml. This translates to the following total amounts of caffeine per container:\n\n| Container Size | Caffeine (mg) |\n|---------------|--------------|\n| 0.25 L        | 80 mg        |\n| 0.33 L        | 106 mg       |\n| 0.5 L         | 160 mg       |\n\nNow, coffee on the other hand has about 44,8 - 80 mg of caffeine per 100 ml, translating to the following dozages:\n\n| Container Size | Caffeine (mg) (Range) |\n|---------------|----------------------|\n| 0.125 L (small cup) | 56 - 100 mg |\n| 0.2 L (medium mug)  | 90 - 160 mg |\n| 0.25 L (large mug)  | 112 - 250 mg |\n\n([Source](https://www.terveyskirjasto.fi/dlk01123))\n\nAnd finally, here's the same as an image -- I hope that by now you'll agree that if you want to be worried about someone getting too much caffeine, you should be worried of those who drink coffee. Coffee doesn't even come with any warnings of the max recommended servings per day, unlike energy drinks. And this post doesn't even begin to address espresso, which is about four times as strong as regular coffee! \n\n\n<img src=\"https://zeroone.micro.blog/uploads/2025/a8b52dfe5e.png\" width=\"600\" height=\"472\" alt=\"\">\n",
				"date_published": "2025-03-16T22:26:32+02:00",
				"url": "https://ville.saalo.moi/2025/03/16/caffeine.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/16/gemini-protocol.html",
				"title": "Gemini protocol",
				"content_html": "<p>The other day I was browsing some random Micro.blog blogs when I came across an <a href=\"https://heyloura.com/2025/03/11/coding-adventure-using-deno-and.html\">interesting post about Gemini in the Hey Loura! blog</a>. Gemini in this case does not refer to Google&rsquo;s AI service but an application layer internet protocol developed quite recently, in 2019.</p>\n<p>Gemini is kind of like HTTP but very, very simple. Gemini&rsquo;s preferred document format is gemtext, which is almost a subset of Markdown: you get headers and lists (but no nested lists) and hyperlinks (that need to be on their own line). You also get quotes and preformatted text for presenting code, but that&rsquo;s it. It does not support, for example, styles or inline images.</p>\n<p>No normal browser supports Gemini. The &ldquo;Geminispace&rdquo; can, however, be accessed by a number of custom browsers that can use the <code>gemini://</code> protocol. Anyone can host a Gemini &ldquo;capsule&rdquo; by themself, or use one of the free or paid services to do that.</p>\n<p>Somehow I find the idea behind Gemini quite appealing: no ads; no big companies trying to hook you or exploit you; no competing for likes or subscriptions; quick loading times; pages where the content speaks for itself. Even the mobile versions of many web sites are rather heavy these days, which can be observed if you&rsquo;ve ever tried to use the internet while traveling in a plane, but Gemini pages promise to be even more light-weight.</p>\n<p>Learn more from the project&rsquo;s web site at <a href=\"https://geminiprotocol.net/\">GeminiProtocol.net</a> or from <a href=\"https://en.wikipedia.org/wiki/Gemini_(protocol)\">Wikipedia</a>.</p>\n",
				"content_text": "The other day I was browsing some random Micro.blog blogs when I came across an [interesting post about Gemini in the Hey Loura! blog](https://heyloura.com/2025/03/11/coding-adventure-using-deno-and.html). Gemini in this case does not refer to Google's AI service but an application layer internet protocol developed quite recently, in 2019.\n\nGemini is kind of like HTTP but very, very simple. Gemini's preferred document format is gemtext, which is almost a subset of Markdown: you get headers and lists (but no nested lists) and hyperlinks (that need to be on their own line). You also get quotes and preformatted text for presenting code, but that's it. It does not support, for example, styles or inline images.\n\nNo normal browser supports Gemini. The \"Geminispace\" can, however, be accessed by a number of custom browsers that can use the `gemini://` protocol. Anyone can host a Gemini \"capsule\" by themself, or use one of the free or paid services to do that.\n\nSomehow I find the idea behind Gemini quite appealing: no ads; no big companies trying to hook you or exploit you; no competing for likes or subscriptions; quick loading times; pages where the content speaks for itself. Even the mobile versions of many web sites are rather heavy these days, which can be observed if you've ever tried to use the internet while traveling in a plane, but Gemini pages promise to be even more light-weight.\n\nLearn more from the project's web site at [GeminiProtocol.net](https://geminiprotocol.net/) or from [Wikipedia](https://en.wikipedia.org/wiki/Gemini_(protocol)). \n",
				"date_published": "2025-03-16T21:07:05+03:00",
				"url": "https://ville.saalo.moi/2025/03/16/gemini-protocol.html",
				"tags": ["indie-web"]
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/09/esc.html",
				"title": "ESC25",
				"content_html": "<p>Last night it was confirmed that the band KAJ would represent Sweden in this year&rsquo;s Eurovision Song Contest. This is funny, because KAJ is, in fact, a Finnish band, so in a sense Finland now has two entries in this year&rsquo;s contest! 😁 KAJ&rsquo;s song is called <em><a href=\"https://en.wikipedia.org/wiki/Bara_bada_bastu\">Bara bada bastu</a></em>, and Finland is sending Erika to the contest with <em><a href=\"https://en.wikipedia.org/wiki/Ich_komme\">Ich komme</a></em>:</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "Last night it was confirmed that the band KAJ would represent Sweden in this year's Eurovision Song Contest. This is funny, because KAJ is, in fact, a Finnish band, so in a sense Finland now has two entries in this year's contest! 😁 KAJ's song is called _[Bara bada bastu](https://en.wikipedia.org/wiki/Bara_bada_bastu)_, and Finland is sending Erika to the contest with _[Ich komme](https://en.wikipedia.org/wiki/Ich_komme)_:\n\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/WK3HOMhAeQY\" title=\"KAJ - Bara Bada Bastu | Sweden 🇸🇪 | National Final Performance | #Eurovision2025\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Kg3QoTpnqyw\" title=\"Erika Vikman - Ich Komme | Finland 🇫🇮 | National Final Performance | #Eurovision2025\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n",
				"date_published": "2025-03-09T21:26:47+02:00",
				"url": "https://ville.saalo.moi/2025/03/09/esc.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/07/energy-drinks.html",
				"title": "Energy drinks",
				"content_html": "<p>I&rsquo;m in the habit of taking a photo of each new energy drink I try. At this point of I can make a nice 4x4 collage out of the ones I&rsquo;ve tried this year, and I even had to leave one out.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I'm in the habit of taking a photo of each new energy drink I try. At this point of I can make a nice 4x4 collage out of the ones I've tried this year, and I even had to leave one out.\n\n<img src=\"https://zeroone.micro.blog/uploads/2025/image.png\" width=\"600\" height=\"600\" alt=\"A collection of various energy drink cans:&10;&10;* Monster Ultra Watermelon&10;* Nocco Focus Stellar Blend&10;* Wolverine Sugar Free&10;* Pirkka BCAA Apple & Pear&10;* Wolverine&10;* Java Monster Salted Caramel&10;* Golden Eagle&10;* Teho Kesäpommi Persikka Lemonade&10;* SportLife Nutrition Juicy BCAA & Energy Mango Persikka&10;* Jaffa Booster appelsiini&10;* The Good Guys Pineapple Express&10;* Puhdistamo Rhuby Lemonade&10;* Monster Ultra Strawberry Dreams&10;* Jaffa Booster vihreä mandariini&10;* State Energy Maracuja&10;*Juiced Kong Strong Colossus Mango \">\n",
				"date_published": "2025-03-07T23:07:30+02:00",
				"url": "https://ville.saalo.moi/2025/03/07/energy-drinks.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/06/helsinki-central-railway-station-at.html",
				"title": "Helsinki central railway station at dusk",
				"content_html": "<p>Helsinki central railway station at dusk:\n📷🤩🌆</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Helsinki central railway station at dusk: \n📷🤩🌆\n\n<img src=\"https://zeroone.micro.blog/uploads/2025/0726d85b64.jpg\" width=\"600\" height=\"337\" alt=\"\">\n",
				"date_published": "2025-03-06T20:29:46+02:00",
				"url": "https://ville.saalo.moi/2025/03/06/helsinki-central-railway-station-at.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/03/th-academy-awards.html",
				"title": "97th Academy Awards",
				"content_html": "<p>I&rsquo;ve watched the Oscars live broadcast close to twenty times now, and I&rsquo;d argue that&rsquo;s no mean feat, as they are aired here in Finland in the middle of the night. I also post my observations about the show to Facebook every year,  and several of my friends there have indicated, either offline or online, that they always look forward to my recap. Waking up in the middle of the night to watch the Oscars feels like madness already, but tradition is tradition! The best way to stay awake is to keep eating snacks. 🍿 The following is a summary of my live observations.</p>\n<p>This year&rsquo;s ceremony faced an unusual challenge, as the wildfires in Hollywood came dangerously close to disrupting the event. Host Conan O&rsquo;Brien even had to relocate to a hotel due to the fires.</p>\n<p>Conan was hosting for the first time, but he made the show his own right from the start. He had some sharp quips, like calling <em>Wicked</em> <em>“a movie for those who watched <em>The Wizard of Oz</em> and wondered what college was like for the side characters”</em> and describing <em>Conclave</em> as <em>“a movie about the Catholic Church — but don’t worry.”</em> He also introduced a new concept: if someone’s speech ran too long, the cameras would cut to John Lithgow, looking extremely disappointed.</p>\n<p>One of the surprises came early in the night when Kieran Culkin won Best Supporting Actor for <em>A Real Pain</em>. In his speech, he reminded his wife of a promise she made a year ago: they could try for a fourth child if he won an Oscar — something she might not have expected to happen. 😄</p>\n<p>In animation, the underdog triumphed as the Latvian film <em>Flow</em> took home Best Animated Feature, breaking the usual Disney/Pixar dominance. Meanwhile, the Iranian short <em>In the Shadow of the Cypress</em>, a PTSD-themed animation, won Best Animated Short, with its creators only receiving their visas the day before the ceremony.</p>\n<p>Unlike previous years, the Costume Design category was given proper attention instead of being rushed through. It was revealed that the same designer from the original <em>Gladiator</em> worked on <em>Gladiator II</em>. The Oscar went to Paul Tazewell for <em>Wicked</em>, making him the first Black man to win in this category.</p>\n<p>Similarly, cinematographers were introduced with the same care. Lol Crawley won for <em>The Brutalist</em>, marking the film’s first win of the night. <em>The Brutalist</em> also picked up Best Actor (Adrien Brody) and Best Score, with Brody ignoring attempts to play him offstage.</p>\n<p>The first half of the show moved at a leisurely pace, even including a random Bond theme medley, but things sped up in the second half as winners were hurried offstage &ndash; although nobody got the ultimate punishment of getting the disappointed look from John Lithgow.</p>\n<p>Other notable wins included:</p>\n<ul>\n<li>Best Adapted Screenplay: <em>Conclave</em>, written by Peter Straughan, who wore a Ukraine pin but otherwise, the ceremony remained largely apolitical.</li>\n<li>Best Makeup and Hairstyling: <em>The Substance</em>, a body horror film. Conan played into this by introducing himself in a clip where he crawled out of Demi Moore&rsquo;s body. 😈</li>\n<li>Best Supporting Actress: Zoe Saldaña for <em>Emilia Pérez</em>, whose speech included a complement about her husband&rsquo;s hair.</li>\n<li>Best Original Song: <em>El Mal</em> from <em>Emilia Pérez</em>, dashing Diane Warren&rsquo;s hopes for a win — her 16th nomination without a victory.</li>\n</ul>\n<p>One of the few winners I had actually seen, <em>Dune: Part Two</em>, won for Best Sound and Best Visual Effects. At one point, Conan even had the Dune sandworm playing the piano and harp, because why not? 😂</p>\n<p>The night&rsquo;s biggest winner was undoubtedly Sean Baker&rsquo;s <em>Anora</em>. It took home:</p>\n<ul>\n<li>Best Original Screenplay (Sean Baker)</li>\n<li>Best  (Sean Baker)</li>\n<li>Best Director (Sean Baker)</li>\n<li>Best Actress (Mikaela &ldquo;Mikey&rdquo; Madison)</li>\n<li>Best Picture</li>\n</ul>\n<p>Baker dedicated his wins to the importance of cinema and gave a special shoutout to his mother, whose birthday was that day.</p>\n<p>The In Memoriam segment honored legends like <a href=\"https://en.wikipedia.org/wiki/Maggie_Smith\">Maggie Smith</a>, <a href=\"https://en.wikipedia.org/wiki/Donald_Sutherland\">Donald Sutherland</a>, and <a href=\"https://en.wikipedia.org/wiki/James_Earl_Jones\">James Earl Jones</a>. The ceremony finally wrapped up an hour later than last year at about 05:45, well before the sunrise at 07:12.</p>\n",
				"content_text": "I've watched the Oscars live broadcast close to twenty times now, and I'd argue that's no mean feat, as they are aired here in Finland in the middle of the night. I also post my observations about the show to Facebook every year,  and several of my friends there have indicated, either offline or online, that they always look forward to my recap. Waking up in the middle of the night to watch the Oscars feels like madness already, but tradition is tradition! The best way to stay awake is to keep eating snacks. 🍿 The following is a summary of my live observations.\n\nThis year's ceremony faced an unusual challenge, as the wildfires in Hollywood came dangerously close to disrupting the event. Host Conan O'Brien even had to relocate to a hotel due to the fires.\n\nConan was hosting for the first time, but he made the show his own right from the start. He had some sharp quips, like calling *Wicked* *“a movie for those who watched *The Wizard of Oz* and wondered what college was like for the side characters”* and describing *Conclave* as *“a movie about the Catholic Church — but don’t worry.”* He also introduced a new concept: if someone’s speech ran too long, the cameras would cut to John Lithgow, looking extremely disappointed.\n\nOne of the surprises came early in the night when Kieran Culkin won Best Supporting Actor for *A Real Pain*. In his speech, he reminded his wife of a promise she made a year ago: they could try for a fourth child if he won an Oscar — something she might not have expected to happen. 😄\n\nIn animation, the underdog triumphed as the Latvian film *Flow* took home Best Animated Feature, breaking the usual Disney/Pixar dominance. Meanwhile, the Iranian short *In the Shadow of the Cypress*, a PTSD-themed animation, won Best Animated Short, with its creators only receiving their visas the day before the ceremony.\n\nUnlike previous years, the Costume Design category was given proper attention instead of being rushed through. It was revealed that the same designer from the original *Gladiator* worked on *Gladiator II*. The Oscar went to Paul Tazewell for *Wicked*, making him the first Black man to win in this category.\n\nSimilarly, cinematographers were introduced with the same care. Lol Crawley won for *The Brutalist*, marking the film’s first win of the night. *The Brutalist* also picked up Best Actor (Adrien Brody) and Best Score, with Brody ignoring attempts to play him offstage.\n\nThe first half of the show moved at a leisurely pace, even including a random Bond theme medley, but things sped up in the second half as winners were hurried offstage -- although nobody got the ultimate punishment of getting the disappointed look from John Lithgow.\n\nOther notable wins included:\n\n- Best Adapted Screenplay: *Conclave*, written by Peter Straughan, who wore a Ukraine pin but otherwise, the ceremony remained largely apolitical.\n- Best Makeup and Hairstyling: *The Substance*, a body horror film. Conan played into this by introducing himself in a clip where he crawled out of Demi Moore's body. 😈\n- Best Supporting Actress: Zoe Saldaña for *Emilia Pérez*, whose speech included a complement about her husband's hair.\n- Best Original Song: *El Mal* from *Emilia Pérez*, dashing Diane Warren's hopes for a win — her 16th nomination without a victory.\n\nOne of the few winners I had actually seen, *Dune: Part Two*, won for Best Sound and Best Visual Effects. At one point, Conan even had the Dune sandworm playing the piano and harp, because why not? 😂\n\nThe night's biggest winner was undoubtedly Sean Baker's *Anora*. It took home:\n\n- Best Original Screenplay (Sean Baker)\n- Best  (Sean Baker)\n- Best Director (Sean Baker) \n- Best Actress (Mikaela \"Mikey\" Madison)\n- Best Picture\n\nBaker dedicated his wins to the importance of cinema and gave a special shoutout to his mother, whose birthday was that day.\n\nThe In Memoriam segment honored legends like [Maggie Smith](https://en.wikipedia.org/wiki/Maggie_Smith), [Donald Sutherland](https://en.wikipedia.org/wiki/Donald_Sutherland), and [James Earl Jones](https://en.wikipedia.org/wiki/James_Earl_Jones). The ceremony finally wrapped up an hour later than last year at about 05:45, well before the sunrise at 07:12. \n",
				"date_published": "2025-03-03T06:12:58+02:00",
				"url": "https://ville.saalo.moi/2025/03/03/th-academy-awards.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/03/02/wordle.html",
				"title": "Wordle",
				"content_html": "<p>Today I reached a streak of 100 in <a href=\"https://www.nytimes.com/games/wordle/index.html\">Wordle</a>. 😃</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "Today I reached a streak of 100 in [Wordle](https://www.nytimes.com/games/wordle/index.html). 😃\n\n<pre>\nWordle 1,352 4/6\n\n⬛⬛⬛🟨⬛\n⬛⬛⬛⬛🟨\n⬛⬛🟨⬛🟩\n🟩🟩🟩🟩🟩\n\nWordleBot\nSkill 90/99\nLuck 46/99\n</pre>\n\n<img src=\"https://zeroone.micro.blog/uploads/2025/afbe1b56d8.jpg\" width=\"582\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-03-02T00:10:45+02:00",
				"url": "https://ville.saalo.moi/2025/03/02/wordle.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/28/currently-reading-the-praised-the.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://trepo.tuni.fi/handle/10024/120127\">The Praised, The Loved, The Deplored, The Forgotten: A View into the Wide History of Finnish Games</a> by Kultima, Annakaisa; Peltokangas, Jouni 📚</p>\n<p>Finnish games introduced briefly, but also contains a handful of interesting interviews. 🎮</p>\n<blockquote>\n<p>If you think about what your average citizen of today should know about the demoscene, the least would be the fact that such a long line of digital culture exists. Even if it&rsquo;s quite hidden from the mainstream, it has given rise to a huge amount of talent. Another is the existence of such media art and a community, of which not much is known, but which has been very active and played a significant part for those involved. Rather than thinking of whatever useful business skills were acquired, I would like the latter point to be the takeaway from all this.</p>\n</blockquote>\n<p>&ndash;lecturer Markku Reunanen 💬</p>\n",
				"content_text": "Currently reading: [The Praised, The Loved, The Deplored, The Forgotten: A View into the Wide History of Finnish Games](https://trepo.tuni.fi/handle/10024/120127) by Kultima, Annakaisa; Peltokangas, Jouni 📚\n\nFinnish games introduced briefly, but also contains a handful of interesting interviews. 🎮\n\n> If you think about what your average citizen of today should know about the demoscene, the least would be the fact that such a long line of digital culture exists. Even if it's quite hidden from the mainstream, it has given rise to a huge amount of talent. Another is the existence of such media art and a community, of which not much is known, but which has been very active and played a significant part for those involved. Rather than thinking of whatever useful business skills were acquired, I would like the latter point to be the takeaway from all this. \n\n--lecturer Markku Reunanen 💬\n",
				"date_published": "2025-02-28T23:28:38+02:00",
				"url": "https://ville.saalo.moi/2025/02/28/currently-reading-the-praised-the.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/27/clash-royale.html",
				"title": "Clash Royale",
				"content_html": "<p><a href=\"https://en.wikipedia.org/wiki/Supercell_(company)\">Supercell</a> is a pretty successful Finnish mobile game company. I have been enjoying Clash Royale in particular. It&rsquo;s a real time game where you have a deck of cards that can bring units to the battle arena, and with them you try to destroy your opponent&rsquo;s King Tower. Cards are played with elixir that regenerates all the time, more or less slowly, depending on the game mode.</p>\n<p>It&rsquo;s kind of like rock-paper-scissors: for example, P.E.K.K.A is a huge, slow tank-like unit that hits hard, but she is no match for a Skeleton Army where each skeleton is weak, but they move and hit fast. The Skeleton Army can be easily countered with e.g. a Valkyrie, which, in turn, cannot beat P.E.K.K.A. The catch is that you can only have eight different cards in your deck, but dozens of different cards exist, so you need to be strategic and versatile.</p>\n<p>Here&rsquo;s an example of an x7 Elixir game that I played, it&rsquo;s quite a mayhem compared to the slower, traditional game modes, but I like it:</p>\n<!-- raw HTML omitted -->\n<p>🎮</p>\n",
				"content_text": "[Supercell](https://en.wikipedia.org/wiki/Supercell_(company)) is a pretty successful Finnish mobile game company. I have been enjoying Clash Royale in particular. It's a real time game where you have a deck of cards that can bring units to the battle arena, and with them you try to destroy your opponent's King Tower. Cards are played with elixir that regenerates all the time, more or less slowly, depending on the game mode.\n\nIt's kind of like rock-paper-scissors: for example, P.E.K.K.A is a huge, slow tank-like unit that hits hard, but she is no match for a Skeleton Army where each skeleton is weak, but they move and hit fast. The Skeleton Army can be easily countered with e.g. a Valkyrie, which, in turn, cannot beat P.E.K.K.A. The catch is that you can only have eight different cards in your deck, but dozens of different cards exist, so you need to be strategic and versatile.\n\nHere's an example of an x7 Elixir game that I played, it's quite a mayhem compared to the slower, traditional game modes, but I like it:\n\n<iframe width=\"315\" height=\"560\"\nsrc=\"https://www.youtube.com/embed/oDGsOVdbOhU \"\ntitle=\"Clash Royale gameplay\"\nframeborder=\"0\"\nallow=\"autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share\"\nallowfullscreen></iframe>\n\n🎮 \n",
				"date_published": "2025-02-27T19:27:13+03:00",
				"url": "https://ville.saalo.moi/2025/02/27/clash-royale.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/26/github.html",
				"title": "GitHub",
				"content_html": "<p>My GitHub account is located at <a href=\"https://github.com/ZeroOne3010.\">github.com/ZeroOne30&hellip;</a> Micro.blog claims these posts can be synced there automatically. Let&rsquo;s see if this triggers the sync! 💻</p>\n",
				"content_text": "My GitHub account is located at [github.com/ZeroOne30...](https://github.com/ZeroOne3010.) Micro.blog claims these posts can be synced there automatically. Let's see if this triggers the sync! 💻\n",
				"date_published": "2025-02-26T19:03:02+03:00",
				"url": "https://ville.saalo.moi/2025/02/26/github.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/26/the-number-has-come-loose.html",
				"title": "Watch woes",
				"content_html": "<p>The number 6 has come loose in my watch. I got a quote for 60-80 € for fixing it. 🤯 That exceeded my expectations 3-10x. I&rsquo;m still considering what to do&hellip; 😞</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "The number 6 has come loose in my watch. I got a quote for 60-80 € for fixing it. 🤯 That exceeded my expectations 3-10x. I'm still considering what to do... 😞\n\n<img src=\"https://zeroone.micro.blog/uploads/2025/image.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-02-26T16:47:44+03:00",
				"url": "https://ville.saalo.moi/2025/02/26/the-number-has-come-loose.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/25/currently-reading-the-end-of.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781982103552\">The End of Everything</a> by Katie Mack 📚</p>\n<p>Really interesting stuff! 😃</p>\n",
				"content_text": "Currently reading: [The End of Everything](https://micro.blog/books/9781982103552) by Katie Mack 📚\n\nReally interesting stuff! 😃\n",
				"date_published": "2025-02-25T23:00:04+02:00",
				"url": "https://ville.saalo.moi/2025/02/25/currently-reading-the-end-of.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/25/cheated-by-intel.html",
				"title": "💻 Cheated by Intel",
				"content_html": "<p>I feel rather cheated by Intel&hellip; I got a new desktop PC in 2020 with an i7-10700K CPU that uses the then-brand-new LGA1200 socket, thinking that as it was brand new, it would have a long and happy life ahead of it and I could safely just upgrade the CPU in the future.</p>\n<p>Well, they used the socket for like two years only. Apparently the socket life spans have gone down dramatically from what they were earlier (like 20 years ago; see e.g. the LGA 775 socket), but Intel is especially bad in this respect, vs. AMD who has longer socket life spans. AMD released the AM4 socket in 2016 and the next socket, AM5, wasn&rsquo;t released until 2022.</p>\n<p>I didn&rsquo;t feel bad for Intel when the news broke the other day that their stock value is plummeting. My next PC won&rsquo;t feature an Intel CPU.</p>\n",
				"content_text": "I feel rather cheated by Intel... I got a new desktop PC in 2020 with an i7-10700K CPU that uses the then-brand-new LGA1200 socket, thinking that as it was brand new, it would have a long and happy life ahead of it and I could safely just upgrade the CPU in the future.\n\nWell, they used the socket for like two years only. Apparently the socket life spans have gone down dramatically from what they were earlier (like 20 years ago; see e.g. the LGA 775 socket), but Intel is especially bad in this respect, vs. AMD who has longer socket life spans. AMD released the AM4 socket in 2016 and the next socket, AM5, wasn't released until 2022.\n\nI didn't feel bad for Intel when the news broke the other day that their stock value is plummeting. My next PC won't feature an Intel CPU.\n",
				"date_published": "2025-02-25T09:32:29+03:00",
				"url": "https://ville.saalo.moi/2025/02/25/cheated-by-intel.html"
			},
			{
				"id": "http://zeroone.micro.blog/2025/02/24/hello-people-i-just-learned.html",
				"title": "Hello! ",
				"content_html": "<p>Hello people! 👋 I just learned about the Micro.blog platform from the <a href=\"https://www.hanselminutes.com/983/microblog-and-owning-your-words-with-manton-reece\">Hanselminutes podcast</a> and decided to join. 🙂</p>\n",
				"content_text": "Hello people! 👋 I just learned about the Micro.blog platform from the [Hanselminutes podcast](https://www.hanselminutes.com/983/microblog-and-owning-your-words-with-manton-reece) and decided to join. 🙂\n",
				"date_published": "2025-02-24T22:31:29+02:00",
				"url": "https://ville.saalo.moi/2025/02/24/hello-people-i-just-learned.html"
			}
	]
}
